benchmark-output-copy/outputRun-f-1000.log
2021-05-11 15:44:05:705 0 sec: 0 operations; est completion in 0 second 
2021-05-11 15:44:06:830 1 sec: 1000 operations; 845.31 current ops/sec; [READ AverageLatency(us)=689.06] [READ-MODIFY-WRITE AverageLatency(us)=1522.89] [CLEANUP AverageLatency(us)=389] [UPDATE AverageLatency(us)=766.91] 
[OVERALL], RunTime(ms), 1183
[OVERALL], Throughput(ops/sec), 845.30853761623
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 9
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.760777683854607
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 9
[TOTAL_GC_TIME_%], Time(%), 0.760777683854607
[READ], Operations, 1000
[READ], AverageLatency(us), 689.06
[READ], MinLatency(us), 248
[READ], MaxLatency(us), 19909
[READ], Return=OK, 1000
[READ], 0, 703.6270810210876
[READ], 1000, 556.4848484848485
[READ-MODIFY-WRITE], Operations, 484
[READ-MODIFY-WRITE], AverageLatency(us), 1522.888429752066
[READ-MODIFY-WRITE], MinLatency(us), 517
[READ-MODIFY-WRITE], MaxLatency(us), 20574
[READ-MODIFY-WRITE], 0, 1556.9301801801803
[READ-MODIFY-WRITE], 1000, 1145.025
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 389.0
[CLEANUP], MinLatency(us), 389
[CLEANUP], MaxLatency(us), 389
[CLEANUP], 0, 389.0
[UPDATE], Operations, 484
[UPDATE], AverageLatency(us), 766.9111570247934
[UPDATE], MinLatency(us), 261
[UPDATE], MaxLatency(us), 12216
[UPDATE], Return=OK, 484
[UPDATE], 0, 783.5247747747748
[UPDATE], 1000, 582.5